{
  "id": "jorijnsmit/binance-full-history",
  "title": "Binance Full History",
  "subtitle": "1 minute candlesticks for all 196 BTC trading pairs",
  "description": "### Introduction\n\nThis wants to be nothing more than a collection of all 1 minute candlesticks on [Binance](https://binance.com). Not all trading pairs are included yet, just the BTC ones (all 196 of them). I am working on fully automating both gathering and uploading the data---see [this GitHub repo](https://github.com/gosuto-ai/candlestick_scraper).\n\n### Content\n\nFor every trading pair all fields as returned by [Binance's official API endpoint for historical candlestick data](https://github.com/binance-exchange/binance-official-api-docs/blob/master/rest-api.md#klinecandlestick-data) are saved into their own csv file. First entry is the first timestamp available on the exchange, which is around 2017 for the longest running pairs.\n\nThe [Getting Started kernel](https://www.kaggle.com/jorijnsmit/getting-started-with-binance-s-candlesticks/) has a quick function that converts each column to its correct data type and shows a simple plot of one of the trading pairs with an added indicator and a volume plot.\n\n![](https://www.googleapis.com/download/storage/v1/b/kaggle-user-content/o/inbox%2F2234678%2Fb8664e6f26dc84e9a40d5a3d915c9640%2Fdownload.png?generation=1582053879538546&alt=media)\n![](https://www.googleapis.com/download/storage/v1/b/kaggle-user-content/o/inbox%2F2234678%2Fcd04ed586b08c1576a7b67d163ad9889%2Fdownload-1.png?generation=1582053899082078&alt=media)\n\n### Inspiration\n\nOne obvious use-case for this data could be general analysis such as adding technical indicators (moving averages, MACD, RSI, etc.) or creating correlation matrices. Other approaches could include backtesting trading algorithms or computing arbitrage potential with other exchanges.\n\n### License\n\nThis data is being scraped automatically from cryptocurrency exchange Binance.",
  "isPrivate": false,
  "licenses": [
    {
      "name": "other"
    }
  ],
  "keywords": [
    "finance",
    "computing",
    "investing",
    "currencies and foreign exchange"
  ],
  "collaborators": []
}
